---
type: ICentralLockedCallback
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# ICentralLockedCallback

`Autodesk.Revit.DB.ICentralLockedCallback` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | ShouldWaitForLockAvailability | 2014 | `bool ShouldWaitForLockAvailability ()` |